Repository: 84000/data-translation-memory
Catalog: toh61-v4.tmx
Source language: bo
Languages: en

source: །མཐུ་ཆེན་ཐོབ་པས་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏ་ལ་སྨྲས་པ། བདག་གིས་དེང་ཁྱོད་ལ་ཡང་དག་པར་སྨྲས་པ་ཡིན་གྱིས་ཐེ་ཚོམ་མ་ཟ་ཤིག །ཇི་ལྟར་སེམས་ཅན་མ་ལུས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་བསྐལ་པ་གཅིག་གམ། བསྐལ་པ་གཅིག་ལས་ལྷག་པའི་བར་དུ་ཐེ་ཚོམ་དྲིས་པ་བས་བདག་གིས་དེ་བཞིན་གཤེགས་པ་ལས་ཆོས་ཀྱི་རྣམ་གྲངས་གཅིག་ཐོས་པའི་སྒོ་ནས་ལན་བཏབ་པ་དེ་བས་ཀྱང་ཆེས་མང་ངོ་།
en: “Mahāsthāmaprāpta continued, ‘I am now telling you the truth, so do not entertain any doubts. Compared to all the doubts and questions expressed by all those sentient beings for an eon or even longer, the answers related to a single Dharma teaching that I heard from the Thus-Gone One were much more numerous.

source: །དེ་བཞིན་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་སྒོ་གཉིས་དང་། གསུམ་དང་། བཞི་དང་། ལྔ་དང་། བཅུ་དང་། ཉི་ཤུ་དང་། སུམ་ཅུ་དང་། བཞི་བཅུ་དང་། ལྔ་བཅུ་ནས། བརྒྱ་དང་། སྟོང་དང་། ཁྲི་དང་། འབུམ་ལ་སོགས་པའི་བར་དུ་ཡང་དེ་བཞིན་ཏེ།
en: The same logic applies with respect to two, three, four, five, ten, twenty, thirty, forty, fifty, one hundred, one thousand, ten thousand, or a hundred thousand Dharma teachings.

source: དགེ་སློང་བདག་གིས་མདོ་ཙམ་དུ་བསྟན་ན་བགྲང་པའི་མིང་དང་། ཡི་གེ་ཇི་སྙེད་པ་ཐམས་ཅད་ནི་ཚད་མེད་པ། མཐར་ཐུག་པ་མེད་པ།
en: Monk, to explain this in summary, the names and letters of that number would be uncountable, infinite, and inconceivable.

source: བསམ་གྱིས་མི་ཁྱབ་པས་གྲངས་དེ་དག་ལས་ཡང་དག་པར་འདས་པར་གྱུར་ཀྱང་བདག་གིས་མ་ལུས་པར་ཁ་ཏོན་དུ་བཏོན་ནས་ཡོངས་སུ་བཟུང་ངོ་།
en: Nevertheless, I recited and embraced all of them.

source: །དགེ་སློང་དྲིས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་གཅིག་ཏུ་འདུས་པར་བདག་གིས་རབ་ཏུ་ཤེས་ཏེ།
en: And yet, monk, I clearly understand that all those questions are contained within a single Dharma teaching.

source: འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་རྒྱལ་པོས་ཡང་དག་པར་གསུང་བའི་ལམ་གྱི་ཚིག་དང་། སྒོའི་ཚིག་དང་། ཕྱག་རྒྱའི་ཚིག་དང་། དངོས་གཞིའི་ཚིག་དང་། རྡོ་རྗེ་ལྟ་བུའི་ཚིག་དང་། རབ་ཏུ་ལྕི་བའི་ཚིག་དང་། མི་གཡོ་བའི་ཚིག་དང་། གཏིང་དཔག་དཀའ་བའི་ཚིག་གང་ཡིན་པའོ།
en: This consists of the words of the path, the words of the gateways, the words of the seals, the fundamental words, the vajra-like words, the important words, the unshakable words, and the unfathomable words spoken by the thus-gone one King of All Qualities’ Light Rays.

source: །དགེ་སློང་སྒོ་གཅིག་ཏུ་ཆོས་ཐམས་ཅད་སྡུད་པ་ནི་འདི་ལྟ་སྟེ།
en: Monk, all the Dharma teachings are included within a single gateway.

source: མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་སྒོ་དག་ཡིན་པས་ཆོས་ཐམས་ཅད་དང་། ཚིག་ཐམས་ཅད་ཀྱང་སྒོ་དེས་གཞི་བྱེད་པའི་ཐམས་ཅད་སྒོ་དེར་འཇུག་པར་འགྱུར་རོ།
en: Since all the Dharma teachings and all their words are gateways free of formations, that gateway acts as the basis for them and therefore everything will be accessed through that gateway.

source: །མདོའི་སྡེ་དང་། ཆེད་དུ་བརྗོད་པའི་སྡེ་ཐམས་ཅད་ཀྱང་སྒོ་དེར་ཞུགས་ནས་ཡི་གེ་གཅིག་རྣམ་པར་ཕྱེ་སྟེ་ཡི་གེ་མང་པོ་ལ་འཇུག་པར་འགྱུར་རོ།
en: All the discourses and aphorisms, moreover, are accessed through that gateway, just as a single syllable, by being grammatically inflected, can form many different words.

source: །དགེ་སློང་དེ་བཞིན་དུ་གཟུངས་ཀྱི་སྒོ་བདུན་ཁྲི་བརྒྱད་སྟོང་པོ་ཐམས་ཅད་ལ་ཡང་འཇུག་པར་འགྱུར་ཏེ།
en: Monk, similarly, this teaching accesses all the seventy-eight thousand gateways of the dhāraṇīs.

source: དེ་ལ་ཡང་དབང་པོ་རྣམས་ཀྱི་བྱེ་བྲག་དགུ་ཁྲི་ཉིས་སྟོང་ཡོད་དོ།
en: In this regard, there are also ninety-two thousand different types of faculties.

source: །སེམས་ཅན་གྱི་སྤྱོད་པའི་སྒོ་ནས་ཀྱང་གཟུངས་ཀྱི་ཁ་དོག་བརྒྱད་ཁྲི་ཡོད་དོ། །ལམ་གྱི་བྱེ་བྲག་གིས་ཐ་དད་པའི་གཟུངས་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱི་མིང་གང་ཡིན་པ་ཡང་བདག་གིས་རབ་ཏུ་ཤེས་སོ།
en: From the perspective of the conduct of sentient beings there are also eighty thousand types of physical complexion. I know the names of all those physical complexions, differentiated in terms of the particularities of the path.

source: །གཟུངས་དེ་དག་རེ་རེ་ལ་ཡང་མིང་བརྒྱ་ཡོད་པ་དང་། དེ་བཞིན་དུ་མིང་ཉིས་བརྒྱ་དང་། མིང་སུམ་བརྒྱ་ཡོད་པ་ནས་མིང་བརྒྱ་སྟོང་དུ་མ་ཡོད་པའི་བར་དག་ཀྱང་བདག་གིས་རབ་ཏུ་ཤེས་སོ།
en: Each of those physical complexions has one hundred names. They have two hundred, three hundred, and up to one hundred thousand different names, and I know all of them.

source: །འཛམ་བུའི་གླིང་ན་ཡོད་པ་ནས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཁམས་ལས་འདས་པའི་བར་དག་ན་ཡོད་པའི་དམིགས་པ་ཐ་དད་པ་དང་། མིང་ཐ་དད་པ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བདག་གིས་རབ་ཏུ་ཤེས་སོ།
en: I also know all the different references and names, from those found within the world to those found beyond the buddhafields of the ten directions.

source: །མདོར་ན་དེ་བཞིན་གཤེགས་པའི་མཐུས་ཆོས་རྣམས་སོ་སོ་ཐ་དད་པའི་བྱེ་བྲག་དང་། དྲིས་པ་དང་། ལན་གྱི་བྱེ་བྲག་ཇི་སྙེད་ཡོད་པ་རྣམས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་རྒྱལ་པོའི་བྱིན་གྱི་རླབས་ཀྱི་མཐུས་བདག་གིས་རབ་ཏུ་ཤེས་སོ། །
en: In short, through the power of the Thus-Gone One, through the power of the blessings of the thus-gone one King of All Qualities’ Light Rays, I clearly know all the particularities of the different Dharma teachings, as well as all the particular questions and answers related to them.’

source: གང་པོ་དེའི་ཚེ་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏས་ཆོས་སྨྲ་བ་མཐུ་ཆེན་ཐོབ་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Pūrṇa, the monk Mahāśumata then requested of the Dharma preacher Mahāsthāmaprāpta,

source: །སྐྱེས་བུ་དམ་པ་སླར་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དུ་གཤེགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་རྒྱལ་པོས་ཡང་དག་པར་གསུངས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་ཡང་དག་པར་རྗེས་སུ་བསྐོར་ཅིང་བདག་གིས་གསོལ་བ་བཏབ་པ་བཞིན་དུ་གནང་བར་མཛད་དུ་གསོལ།
en: ‘Sublime being, later, when you go to villages, cities, and towns, please turn the Dharma wheel that the thus-gone one King of All Qualities’ Light Rays taught.

source: བདག་གིས་ཡང་དག་པར་བསྲུང་ཞིང་ཆོས་མཉན་པར་འཚལ་ལོ།
en: Please grant me my request! I will guard that Dharma and study it.’

source: །མཐུ་ཆེན་ཐོབ་པས་སྨྲས་པ། ད་ལྟར་གྱི་དུས་ཀྱི་དགེ་སློང་རྣམས་ནི་ཐམས་ཅད་ཀྱང་ལེ་ལོ་དང་སྙོམ་ལས་ཅན་དུ་གྱུར་ཏེ།
en: “Mahāsthāmaprāpta replied, ‘All the monks living today have become lazy and indolent.

source: དགེ་བའི་ཆོས་ལ་སོགས་པའི་ལྷག་པའི་བསམ་པ་མེད་པས་ཁྱོད་དེ་སྐད་མ་ཟེར་ཅིག །
en: They are not motivated by virtue, so do not ask for such a thing!’

source: མ་ཧཱ་ཤུ་མ་ཏས་སྨྲས་པ། བདག་ནི་དེང་ཕྱིན་ཅད་དགེ་བའི་ཆོས་ལ་ལྷག་པའི་བསམ་པ་བསྐྱེད་ནས་ཆོས་དེ་གཉེར་བར་བགྱིད་པས་ལེ་ལོ་མི་བགྱིད་དོ།
en: “Mahāśumata then said, ‘From now on, I will give rise to the extraordinary resolve of engaging in virtue and pursuing that Dharma. I will not be lazy!’

source: །གང་པོ་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏས་མཐུ་ཆེན་ཐོབ་པ་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དུ་འཇུག་ཅིང་ཡང་དག་པའི་ཆོས་བཤད་པར་གསོལ་བ་བཏབ་ནས་རྗེས་སུ་བསྲུང་བ་བྱས་ཏེ་སྔོན་མ་ཐོས་པའི་ཆོས་ཡང་དག་པར་མཉན་ཏོ།
en: “Pūrṇa, accordingly, when Mahāsthāmaprāpta entered villages, cities, and towns, the monk Mahāśumata supplicated him to expound the authentic Dharma. Then he guarded that Dharma that he had never heard before and studied it attentively.

source: །གང་པོ་དེའི་ཚེ་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏ་སྐྱེ་བོ་རྣམས་ཀྱིས་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱས་ཏེ་མང་པོ་ཀུན་གྱིས་ཚུལ་ཁྲིམས་སྲུང་བ་དང་། ཤེས་རབ་དང་ལྡན་པ་དང་། མང་དུ་ཐོས་པའི་ཡོན་ཏན་མཆོག་ཚད་མེད་པ་དང་ལྡན་པའོ། །ཞེས་བརྗོད་པར་གྱུར་ཏོ།
en: Pūrṇa, at that time, the monk Mahāśumata was venerated and served by many beings. They all said that he was guarding his discipline, that he was wise, and that he possessed the infinite and supreme qualities of erudition.

source: །དེའི་ཚེ་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏས་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དག་ཏུ་སོང་ནས་སེམས་ཅན་མང་པོ་ཡང་དག་པའི་ཆོས་ལ་གཟུད་པ་དང་། གཞན་ཡང་སངས་རྒྱས་ཀྱི་བསྟན་པ་ཀུན་ཏུ་སྤེལ་བའི་ཆེད་དུ་ཆོས་སྨྲ་བ་མཐུ་ཆེན་ཐོབ་པའི་བསྔགས་པ་ཡང་རབ་ཏུ་བརྗོད་པར་གྱུར་ཏོ།
en: At that time, when the monk Mahāśumata went to villages, cities, and towns, he led many sentient beings to the authentic Dharma. Furthermore, in order to propagate the teachings of the Buddha, he proclaimed the praises of the Dharma preacher Mahāsthāmaprāpta.

source: །གང་པོ་དེའི་ཚེ་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏས་སྐྱེ་བོ་མང་པོ་རྣམས་ཡང་དག་པར་བསྐུལ་ནས་ཆོས་ལ་མཆོད་པར་བྱ་བ་དང་། དམ་པའི་ཆོས་མཉན་པའི་ཕྱིར་ཆོས་སྨྲ་བ་མཐུ་ཆེན་ཐོབ་པ་ལ་བསྙེན་བཀུར་དང་། རིམ་གྲོ་དང་། ཡང་དག་པར་སྲུང་བ་བྱེད་དུ་བཅུག་གོ །གང་པོ་ཆོས་སྨྲ་བ་མཐུ་ཆེན་ཐོབ་པ་ཡང་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏས་ཡང་དག་པར་བསྲུང་བ་བྱས་པས་ཕྱིས་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དག་ཏུ་སོང་ནས་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་རྒྱལ་པོས་བསྐལ་པ་གྲངས་མེད་པ་རྣམས་སུ་བྱང་ཆུབ་མངོན་པར་བསྒྲུབས་པ་གང་ཡིན་པ་དེ་དག་རྣམ་པ་སྣ་ཚོགས་ཀྱི་སྒོ་ནས་རྒྱ་ཆེར་ཡང་དག་པར་བཤད་དེ། ཀུན་ཏུ་རྒྱ་ཆེར་རབ་ཏུ་སྤེལ་ཏོ།
en: Pūrṇa, the monk Mahāśumata inspired many beings and caused them to serve, venerate, and protect the Dharma preacher Mahāsthāmaprāpta, in order that they would worship and listen to the sublime Dharma. “Pūrṇa, the monk Mahāśumata also looked after the Dharma preacher Mahāsthāmaprāpta. Later, when he went to villages, cities, and towns, he explained extensively and through various methods the awakening that the thus-gone one King of All Qualities’ Light Rays had accomplished over the course of countless eons. This teaching was thereby propagated on a vast scale.

source: །གང་པོ་འདི་ལྟར་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏས་ཀྱང་ལོ་བརྒྱའི་བར་དུ་རྟག་པར་ཆོས་སྨྲ་བ་མཐུ་ཆེན་ཐོབ་པའི་རྗེས་སུ་འབྲངས་ནས་ཆོས་རྣམས་ཡང་དག་པར་དྲིས་ཀྱང་རྟག་པར་གསར་དུ་ཐ་དད་པའི་ཆོས་ཡང་དག་པར་བསྟན་གྱི །ནམ་ཡང་ཟློས་བུ་སྨྲས་པར་མ་གྱུར་ཏོ།
en: Pūrṇa, the monk Mahāśumata followed the Dharma preacher Mahāsthāmaprāpta for one hundred years. He constantly asked him questions about the Dharma, and he always received new and different teachings that were never repeated.

source: །གང་པོ་ཆོས་སྨྲ་བ་མཐུ་ཆེན་ཐོབ་པ་ཡང་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏས་ཡང་དག་པར་རབ་ཏུ་བསྲུངས་པའི་ཕྱིར་སེམས་ཅན་ཚད་མེད་པ་སྙེད་འཕགས་པའི་བསྟན་པ་ལ་ཡང་དག་པར་བཙུད་ནས་སེམས་ཅན་ཚད་མེད་པ་སྙེད་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལ་ཡང་དག་པར་བཀོད་དོ།
en: Pūrṇa, since the monk Mahāśumata carefully looked after the Dharma preacher Mahāsthāmaprāpta, innumerable sentient beings were introduced to the noble teachings, and all of them were established in the awakening of the buddhas.

source: །གང་པོ་ཁྱོད་ཀྱིས་དེའི་ཚེ་དེའི་དུས་ན་ཆོས་སྨྲ་བ་མཐུ་ཆེན་ཐོབ་པས་དམ་པའི་ཆོས་ཡང་དག་པར་བསྲུངས་ཤིང་ཆོས་ལེགས་པར་བཤད་པ་དེ་གཞན་ཡིན་སྙམ་དུ་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་འདི་ཉིད་ཡིན་ནོ།
en: “Pūrṇa, the Dharma preacher Mahāsthāmaprāpta who guarded and expounded the sublime Dharma at that time was the bodhisattva Maitreya himself. Do not think that this was someone else.

source: །གང་པོ་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏ་ཡང་ཆོས་སྨྲ་བ་ཡང་དག་པར་བསྲུངས་ཞིང་གསོལ་བ་བཏབ་པ་དང་། གྲོགས་བྱས་པའི་བསོད་ནམས་ཀྱི་མཐུས་ཤི་བའི་འོག་ཏུ་འོག་གི་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་བཅུ་པ་དེ་བཞིན་གཤེགས་པ་འཁོར་མཆོག་ཏུ་གྱུར་པ་ཞེས་བྱ་བའི་ཞིང་དུ་སྐྱེས་ནས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཚོམ་ཡོངས་སུ་གཅོད་པ་ཞེས་བྱ་བའི་མདོ་སྡེ་འདི་ཡང་དག་པར་ཞུས་པ་དང་། དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེས་ཀྱང་ལེགས་སོ་ཞེས་བྱ་བའི་བསྔགས་པ་ལན་བརྒྱ་སྟོང་དུ་མ་བརྗོད་ནས་དེ་ལ་ཆོས་ཐམས་ཅད་སྡུད་ཅིང་འབྱུང་བར་བྱེད་པའི་སྒོ་ཞེས་བྱ་བའི་མདོ་སྡེ་ཡང་དག་པར་བསྟན་ཏོ།
en: Pūrṇa, furthermore, through the power of the merit gathered by looking after, supplicating, and accompanying the Dharma preacher, after he passed away, the monk Mahāśumata was reborn in the tenth universe in the direction of the nadir, within the field of the thus-gone one known as Supreme Assembly. There he requested that Thus-Gone One to teach the discourse known as Eliminating the Doubts of All Beings. At that time, the Thus-Gone One expressed his approval one hundred thousand times and then taught him the discourse called The Gateway to the Compendium and Source of All Dharma Teachings.

source: །མདོ་སྡེ་འདི་ཡང་དག་པར་བསྟན་པ་ན་སེམས་ཅན་ཚད་མེད་པ་སྙེད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་ཡང་དག་པ་ཉིད་དུ་སེམས་པ་ལ་རབ་ཏུ་ཞུགས་པར་གྱུར་ཏོ།
en: As he taught this discourse, countless sentient beings gave rise to the mind set on unsurpassed and perfect awakening, and genuinely engaged in that attitude.

source: །གང་པོ་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏ་འཆི་བའི་དུས་བྱས་པའི་འོག་ཏུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་རི་རབ་ཅེས་བྱ་བ་དང་ཕྲད་ནས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཆོས་ཐམས་ཅད་སྡུད་ཅིང་འབྱུང་བར་བྱེད་པ་ཞེས་བྱ་བའི་མདོ་སྡེ་ཡང་དག་པར་ཞུས་པ་དང་། དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེས་ཀྱང་ལེགས་སོ་ཞེས་བྱ་བའི་བསྔགས་པ་ལན་བརྒྱ་སྟོང་དུ་མ་བརྗོད་ནས་དེ་ལ་ཆོས་ཐམས་ཅད་སྡུད་ཅིང་འབྱུང་བར་བྱེད་པའི་སྒོ་ཞེས་བྱ་བའི་མདོ་སྡེ་ཡང་དག་པར་བསྟན་ཏོ།
en: “Pūrṇa, after that when the monk Mahāśumata passed away again, he was reborn in the presence of the thus-gone one called Sumeru, from whom he requested the discourse called The Compendium and Source of All Dharmas. At that time, that thus-gone one expressed his approval one hundred thousand times and taught him the discourse called The Gateway to the Compendium and Source of All Dharmas.

source: །མདོ་སྡེ་འདི་ཡང་དག་པར་བསྟན་པ་ན་སེམས་ཅན་ཚད་མེད་པ་སྙེད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཏོ།
en: As he taught this discourse, countless sentient beings became certain to attain unsurpassed and perfect awakening.

source: །དེ་ནས་ཡང་འཆི་བའི་དུས་བྱས་ཏེ་དེ་བཞིན་གཤེགས་པ་རིའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་ཕྲད་ནས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་ཞེས་བྱ་བའི་མདོ་སྡེ་ཡང་དག་པར་ཞུས་པ་དང་དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེས་ཀྱང་ལེགས་སོ་ཞེས་བྱ་བའི་བསྔགས་པ་ལན་བརྒྱ་སྟོང་དུ་མ་བརྗོད་ནས་དེ་ལ་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་ཞེས་བྱ་བའི་མདོ་སྡེ་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: “Then, after he had passed away again, he was reborn in the presence of the thus-gone one called Merurāja, from whom he requested the discourse called The Gateway of All Dharmas. At that time, that thus-gone one expressed his approval one hundred thousand times and taught him in detail the discourse called The Gateway of All Dharmas.

source: །མདོ་སྡེ་འདི་དག་ཡང་དག་པར་བསྟན་པ་ན་སེམས་ཅན་ཚད་མེད་པ་སྙེད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཏོ།
en: As he taught this discourse, countless sentient beings became certain to attain unsurpassed and perfect awakening.

source: །དེ་ནས་ཡང་འཆི་བའི་དུས་བྱས་ཏེ་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབྱངས་ཤེས་བྱ་བ་དང་ཕྲད་ནས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཆོས་ཐམས་ཅད་ཡང་དག་པར་སྡུད་པ་ཞེས་བྱ་བའི་མདོ་སྡེ་ཡང་དག་པར་ཞུས་པ་དང་། དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེས་ཀྱང་ལེགས་སོ་ཞེས་བྱ་བའི་བསྔགས་པ་བརྗོད་ནས་དེ་ལ་ཆོས་ཐམས་ཅད་ཡང་དག་པར་སྡུད་པ་ཞེས་བྱ་བའི་མདོ་སྡེ་རྒྱ་ཆེར་ཡང་དག་པར་བསྟན་ཏོ།
en: “Then, after he had passed away once more, he was reborn in the presence of the thus-gone one called Brahmaghoṣa, from whom he requested the discourse called The Compendium of All Dharmas. At that time, that thus-gone one expressed his approval one hundred thousand times and taught him in detail the discourse called The Compendium of All Dharmas.

source: །གང་པོ་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏས་དེ་བཞིན་གཤེགས་པ་གཅིག་ནས་གཅིག་ཏུ་སངས་རྒྱས་མང་པོ་དང་ཕྲད་ནས་མདོ་སྡེ་མང་པོ་ཞུས་པ་དང་། སེམས་ཅན་ཡོངས་སུ་བཟླས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བཀོད་པ་གང་ཡིན་པ་དེ་དག་ངས་གལ་ཏེ་བསྐལ་པའམ།
en: “Pūrṇa, the monk Mahāśumata requested many discourses as he came into the presence of all those buddhas, meeting one thus-gone one after another. He saved sentient beings and established them in the state of unsurpassed and perfect awakening.

source: བསྐལ་པ་ལས་ལྷག་པར་བརྗོད་པར་གྱུར་ན་ཡང་སངས་རྒྱས་མང་པོ་དེ་དག་གི་མཚན་དང་། སེམས་ཅན་ཇི་སྙེད་ཅིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་བཀོད་པ་དེ་དག་མཐར་ཐུག་པར་མི་འགྱུར་རོ།
en: Even if I were to speak for eons or even longer, it would not be enough time to mention the names of all those many buddhas, or to mention all those sentient beings who were established within the state of unsurpassed and perfect awakening.

source: །གང་པོ་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏས་ཇི་ཙམ་དུ་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་ན་མངོན་དུ་བཞུགས་པའམ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་རྣམས་ཀྱི་བསྟན་པ་རྣམས་ཡང་དག་པར་བསྲུངས་པའི་གྲངས་ནི་བརྗོད་ཀྱིས་ཀྱང་མི་ལང་ངོ་།
en: Pūrṇa, indescribable is the number of teachings preserved by the monk Mahāśumata, which were taught to him by those thus-gone ones—those buddhas as numerous as the grains of sand in the Ganges river—who were present in those worlds or had passed into complete nirvāṇa.

source: །གང་པོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་སྔོན་མ་ཐོས་པའི་ཆོས་ཐོས་ནས་དོན་གྱི་ཚུལ་ཡིད་ལ་སེམས་པར་བྱེད་ན་ཡོན་ཏན་རྒྱ་མཚོ་ཆེན་པོ་དེ་ལྟ་བུ་དག་ཐོབ་པར་འགྱུར་བར་རིག་པར་བྱའོ།
en: Pūrṇa, you should therefore understand that bodhisattva great beings will attain such vast qualities if they contemplate the meaning of previously unheard Dharma teachings.

source: །གང་པོ་ཁྱོད་ཀྱིས་དེའི་ཚེ་དེའི་དུས་ན་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏས་ཆོས་སྨྲ་བ་མཐུ་ཆེན་ཐོབ་པ་ལས་སྔོན་མ་ཐོས་པའི་ཆོས་ཐོས་ནས་དོན་གྱི་ཚུལ་གྱི་རྗེས་སུ་འབྲངས་པར་གྱུར་པ་དེ་གཞན་ཡིན་སྙམ་དུ་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཀེའུ་ཝེར་དུ་ཞེས་བྱ་བ་འདི་ཉིད་ཡིན་ཏེ།
en: “Pūrṇa, the monk Mahāśumata who, at that time, received Dharma teachings that he had never heard before from the Dharma preacher Mahāsthāmaprāpta, and then followed their meaning, was the bodhisattva Kauverdu himself. Do not think that this was someone else.

source: དེའི་ཚེ་དགེ་སློང་མ་ཧཱ་ཤུ་མ་ཏས་ཡང་དག་པའི་ཆོས་བསྲུངས་པ་དང་། སྔོན་མ་ཐོས་པའི་ཆོས་མཉན་ནས་དོན་གྱི་རྗེས་སུ་འབྲང་ཞིང་ཚིག་ལ་མངོན་པར་ཞེན་པ་མེད་པའི་རྒྱུ་དང་རྐྱེན་གྱིས་སངས་རྒྱས་མང་པོ་དང་ཕྲད་ནས་མདོ་སྡེ་ཟབ་མོ་ཤིན་དུ་གྱ་ནོམ་པ་མང་པོ་ཐོས་པ་དང་། སྔོན་གྱི་དགེ་བའི་རྩ་བའི་རྒྱུ་དང་རྐྱེན་གྱིས་དེང་འདི་རང་ལ་ཡང་ཆོས་ཐམས་ཅད་ཡང་དག་པར་སྡུད་པ་རྒྱ་མཚོ་ལྟ་བུའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཞེས་བྱ་བའི་མདོ་སྡེ་ཞུས་པ་ལས་ཀྱང་ངས་ཀྱང་ཡང་དག་པར་བསྟན་པས་སེམས་ཅན་ཚད་མེད་པ་སྙེད་ཕན་པ་ཆེན་པོ་ཐོབ་པར་གྱུར་པ་ཡིན་ནོ།
en: At that time, the monk Mahāśumata guarded the authentic Dharma, received Dharma teachings that he had never heard before, followed their meaning, and did not cling to their words. As a consequence, he came into the presence of many buddhas and received many excellent and profound discourses from them. Due to those previous roots of virtue, he has now requested from me the discourse called The Oceanic Dharma Teaching That Subsumes All Dharma Teachings.

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་འདི་ཉིད་ཡང་བསྟན་པའི་ཕྱིར་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: I have taught it to him, and countless beings have thereby been greatly benefitted.” At that moment, the Blessed One uttered these verses to explain that point:

source: །བྱང་ཆུབ་སེམས་དཔས་མ་ཐོས་ཆོས། །ཐོས་ནས་དོན་ཚུལ་བསམ་བྱ་ཡི། །བདག་གི་སྔོན་ཆད་མ་ཐོས་ཞེས། །དེ་སྐད་དུ་ནི་སྨྲ་མི་བྱ།
en: “When bodhisattvas hear a Dharma teaching That they have not heard before, They should contemplate its meaning, and not object, ‘I have never heard such a teaching before.’

source: །ཡང་དག་དྲན་པས་དོན་སེམས་ན།
en: If they contemplate its meaning with genuine recollection,

source: །རྒྱ་མཚོར་འབབ་ཆུ་ཤོང་བ་བཞིན། །དེ་ཕྱིར་ཤེས་རབ་འཕེལ་བར་འགྱུར།
en: Their insight will increase, Just like a waterfall pouring into an ocean.

source: །མང་དུ་ཐོས་པ་འཕེལ་འགྱུར་ཞིང་། །ཤེས་རབ་དག་ཀྱང་འཕེལ་བར་འགྱུར། །སངས་རྒྱས་མཛད་པ་ཐོབ་འགྱུར་ཞིང་། །རྒྱ་ཆེར་སེམས་ཅན་ཕན་ཡང་འདོགས།
en: “Both their erudition and insight Will increase, And they will perform the deeds of the buddhas, Benefitting sentient beings on a vast scale.

source: །མང་ཐོས་རྒྱ་མཚོ་སོགས་འགྱུར་ཞིང་།
en: “Their level of erudition will become as vast as an ocean,

source: །ཤེས་རབ་དག་ཀྱང་གཏུགས་མི་འགྱུར།
en: And their insight will never be exhausted.

source: །ཚིག་གི་དོན་ནི་རབ་ཤེས་པས།
en: Understanding clearly the meaning of the words,

source: །ཁྱད་པར་ནང་ན་མཆོག་ཏུ་འགྱུར།
en: They will become preeminent beings.

source: །དེ་ཕྱིར་སྔོན་ཆད་མ་ཐོས་ཆོས། །ཡང་དག་པར་ནི་མཉན་པར་བྱ། །མ་ཐོས་ཆོས་ནི་ཉན་བྱེད་ན། །དེ་འདྲའི་རྣམ་སྨིན་ཐོབ་པར་འགྱུར།།
en: “Therefore, bodhisattvas should listen To Dharma teachings that they have never heard before. If they do so, they will experience Such a karmic maturation.

source: གཞན་ཡང་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་མང་དུ་ཐོས་པ་ཡོངས་སུ་གཉེར་བ་ལ་ཤིན་དུ་འདུན་པའི་བསམ་པ་བསྐྱེད་ཅིང་གནས་དབེན་པར་གནས་པ་ལ་མོས་པའི་བསམ་པ་རབ་ཏུ་བསྐྱེད་ནས་སེམས་རྩེ་གཅིག་ཏུ་ནན་ཏན་བརྩོན་འགྲུས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་གཉེར་བར་བྱའོ།
en: “Furthermore, Pūrṇa, bodhisattva great beings should become determined to pursue erudition, and they must form the aspiration to remain in isolated places. Then, they should pursue unsurpassed and perfect awakening one-pointedly and with persistent diligence.

source: །ཡོངས་སུ་གཉེར་ནས་ཀྱང་ཞེ་སྡང་ཡོངས་སུ་སྤང་བའི་ཕྱིར་བྱམས་པ་བསྒོམ་པར་བྱའོ།
en: In order to abandon anger, they should cultivate love.

source: །འདོད་ཆགས་ཡོངས་སུ་སྤང་བའི་ཕྱིར་མི་སྡུག་པ་བསྒོམ་པར་བྱའོ།
en: In order to abandon desire, they should meditate on repulsiveness.

source: །གཏི་མུག་ཡོངས་སུ་སྤང་བའི་ཕྱིར་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་བསྒོམ་པར་བྱའོ།
en: In order to abandon ignorance, they should meditate on dependent origination.

source: །གང་པོ་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ནི་གང་ཡིན།
en: “Pūrṇa, what is the diligence of bodhisattvas?

source: བྱང་ཆུབ་སེམས་དཔའ་ཇི་ལྟར་ན་བརྩོན་འགྲུས་རྩོམ་པར་བྱེད་ཅེ་ན།
en: How does a bodhisattva cultivate diligence?

source: གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལ་ཞིག་བསྐལ་པ་གཅིག་གམ། བསྐལ་པ་གཅིག་ལས་ཉུང་བ་ཞིག་ཏུ་འགྲོ་འམ་འདུག་པ་དག་ཏུ་རྟག་པར་བརྩོན་འགྲུས་བསྐྱེད་པར་བྱའོ་སྙམ་དུ་སེམས་ན། གང་པོ་དེ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཡང་དག་པའི་བརྩོན་འགྲུས་ཞེས་མི་བྱའོ།
en: Pūrṇa, if you think that, for an eon or for less than an eon, bodhisattvas should constantly cultivate their diligence whenever they are walking or sitting, this is not what is meant by authentic diligence.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལ་ཞིག་བསྐལ་བ་གཅིག་གམ། བསྐལ་པ་གཅིག་ལས་ཉུང་བ་ཞིག་ཏུ་ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་བསྲུངས་པ་དང་། དཀའ་ཐུབ་སྤྱད་པ་དང་། སྦྱངས་པའི་ཡོན་ཏན་དང་ལྡན་པར་གྱུར་ཀྱང་དམིགས་པའི་དངོས་པོའི་རྗེས་སུ་འདོད་པའི་སེམས་བསྐྱེད་ནས་ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་དང་བྲལ་བར་གྱུར་ན་འདི་ལྟ་བུ་ཡང་དག་པའི་བརྩོན་འགྲུས་ཞེས་མི་བྱའོ།
en: Even if, for an eon or for less than an eon, bodhisattvas maintain pure discipline, practice austerities, and observe ascetic practices, if they become attached to the objects that they apprehend and so are disconnected from the true nature of phenomena, this is not what is meant by authentic diligence.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་གང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཡང་དག་པའི་བརྩོན་འགྲུས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་རབ་ཏུ་བསྔགས་པར་འགྱུར་ཞིང་འཇིག་རྟེན་པའི་མཁས་པ་རྣམས་ཀྱིས་སྨད་པར་མི་འགྱུར་བ་དེ་གང་ལགས།
en: “Blessed One,” asked the venerable Pūrṇa, “what is the authentic diligence of bodhisattvas that is praised by the thus-gone ones and that is not criticized by the wise ones within the world?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་པོ་བྱང་ཆུབ་སེམས་དཔས་སྔོན་མ་ཐོས་པའི་ཆོས་ཟབ་མོ་སྟོང་པ་ཉིད་དང་ལྡན་པ། མཚན་མ་ཅུང་ཟད་ཙམ་ཡང་མེད་ཅིང་དོན་དམ་པའི་རྗེས་སུ་འཐུན་པ་དེ་ལྟ་བུའི་མདོ་སྡེ་ཟབ་མོ་ཐོས་པར་གྱུར་ན་མི་འཐུན་ཞིང་འགལ་བ་མེད་པར་དེའི་དོན་གསལ་བར་རྟོགས་པར་བྱ་བའི་ཕྱིར་ནན་ཏན་བརྩོན་འགྲུས་བསྐྱེད་ནས་སེམས་ལ་ནུར་བ་མེད་པར་ཉན་པ་དང་། ལེན་པ་དང་། ཀློག་པ་དང་། ཁ་ཏོན་དུ་འདོན་པ་དང་། གཞན་ལ་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་བྱེད་པ་གང་ཡིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡང་དག་པའི་བརྩོན་འགྲུས་ཞེས་བྱའོ།
en: “Pūrṇa,” replied the Blessed One, “(1) take the case of bodhisattvas who hear for the first time a profound discourse related to emptiness, which is utterly free from conceptual marks and in harmony with the ultimate. If, in order to make its meaning clearly understood, without any conflict or contradiction, those bodhisattvas properly listen to it, accept it, read it, recite it, and teach it to others on a vast scale with persistent diligence, this is what is meant by the authentic diligence of bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་ཆོས་དང་པོ་འདི་དང་ལྡན་པར་གྱུར་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་ལྡོག་པར་མི་འགྱུར་རོ།
en: If bodhisattvas possess this first quality, their progress toward unsurpassed and perfect awakening will be irreversible.

source: །མདོ་སྡེ་ཟབ་མོ་ཐོས་ནས་དེའི་དོན་རབ་ཏུ་རྟོགས་ཏེ་མི་འཐུན་པ་མེད་ཅིང་འགལ་བ་མེད་པའི་བརྩོན་འགྲུས་དེ་ལྟ་བུ་དེ་ལ་ནི་སངས་རྒྱས་རྣམས་ཀྱིས་བསྔགས་པར་འགྱུར་ཞིང་འཇིག་རྟེན་པའི་མཁས་པ་རྣམས་ཀྱིས་ཀྱང་སྨད་པར་མི་འགྱུར་བས་དེའི་ཕྱིར་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཇི་ལྟར་འཇིག་རྟེན་པའི་སེམས་ཅན་རྣམས་ཀྱིས་གཏིང་མི་རྙེད་པ་གང་ཡིན་པ་དེ་བདག་གིས་འདིར་གཏིང་གི་མཐར་ཐུག་པར་བྱའོ།
en: “(2) When they hear profound discourses that they have never heard before, bodhisattvas should clearly understand their meaning. Such a diligence, free from conflict or contradiction, will be praised by the buddhas and will not be criticized by the wise ones within the world. Therefore, Pūrṇa, bodhisattvas should don the armor that is expressed in these thoughts: ‘I shall reach the depths that worldly beings cannot reach.

source: །འཇིག་རྟེན་པའི་སེམས་ཅན་རྣམས་བྱིང་བར་གྱུར་པའི་གནས་གང་ཡིན་པ་དེ་བདག་གིས་བྱིང་བར་མི་བྱའོ།
en: I will not sink in those places where worldly sentient beings are sinking.
